TexasInstruments/f29h85x-sdk/source/driverlib/adc.h
typedef enum
{
	ADC_TRIGGER_SW_ONLY		 = 0,	//!Software only
	ADC_TRIGGER_CPU1_TINT0		 = 1,	//!CPU1 Timer 0, TINT0
	ADC_TRIGGER_CPU1_TINT1		 = 2,	//!CPU1 Timer 1, TINT1
	ADC_TRIGGER_CPU1_TINT2		 = 3,	//!CPU1 Timer 2, TINT2
	ADC_TRIGGER_GPIO		 = 4,	//!GPIO, ADCEXTSOC
	ADC_TRIGGER_EPWM1_SOCA		 = 5,	//!ePWM1, ADCSOCA
	ADC_TRIGGER_EPWM1_SOCB		 = 6,	//!ePWM1, ADCSOCB
	ADC_TRIGGER_EPWM2_SOCA		 = 7,	//!ePWM2, ADCSOCA
	ADC_TRIGGER_EPWM2_SOCB		 = 8,	//!ePWM2, ADCSOCB
	ADC_TRIGGER_EPWM3_SOCA		 = 9,	//!ePWM3, ADCSOCA
	ADC_TRIGGER_EPWM3_SOCB		 = 10,	//!ePWM3, ADCSOCB
	ADC_TRIGGER_EPWM4_SOCA		 = 11,	//!ePWM4, ADCSOCA
	ADC_TRIGGER_EPWM4_SOCB		 = 12,	//!ePWM4, ADCSOCB
	ADC_TRIGGER_EPWM5_SOCA		 = 13,	//!ePWM5, ADCSOCA
	ADC_TRIGGER_EPWM5_SOCB		 = 14,	//!ePWM5, ADCSOCB
	ADC_TRIGGER_EPWM6_SOCA		 = 15,	//!ePWM6, ADCSOCA
	ADC_TRIGGER_EPWM6_SOCB		 = 16,	//!ePWM6, ADCSOCB
	ADC_TRIGGER_EPWM7_SOCA		 = 17,	//!ePWM7, ADCSOCA
	ADC_TRIGGER_EPWM7_SOCB		 = 18,	//!ePWM7, ADCSOCB
	ADC_TRIGGER_EPWM8_SOCA		 = 19,	//!ePWM8, ADCSOCA
	ADC_TRIGGER_EPWM8_SOCB		 = 20,	//!ePWM8, ADCSOCB
	ADC_TRIGGER_EPWM9_SOCA		 = 21,	//!ePWM9, ADCSOCA
	ADC_TRIGGER_EPWM9_SOCB		 = 22,	//!ePWM9, ADCSOCB
	ADC_TRIGGER_EPWM10_SOCA		 = 23,	//!ePWM10, ADCSOCA
	ADC_TRIGGER_EPWM10_SOCB		 = 24,	//!ePWM10, ADCSOCB
	ADC_TRIGGER_EPWM11_SOCA		 = 25,	//!ePWM11, ADCSOCA
	ADC_TRIGGER_EPWM11_SOCB		 = 26,	//!ePWM11, ADCSOCB
	ADC_TRIGGER_EPWM12_SOCA		 = 27,	//!ePWM12, ADCSOCA
	ADC_TRIGGER_EPWM12_SOCB		 = 28,	//!ePWM12, ADCSOCB
	ADC_TRIGGER_REPEATER1		 = 40,	//!Repeater 1
	ADC_TRIGGER_REPEATER2		 = 41,	//!Repeater 2
	ADC_TRIGGER_CLB1_OUT27		 = 72,	//!CLB1 OUT27
	ADC_TRIGGER_CLB2_OUT27		 = 73,	//!CLB2 OUT27
	ADC_TRIGGER_CLB3_OUT27		 = 74,	//!CLB3 OUT27
	ADC_TRIGGER_CLB4_OUT27		 = 75,	//!CLB4 OUT27
	ADC_TRIGGER_CLB5_OUT27		 = 76,	//!CLB5 OUT27
	ADC_TRIGGER_CLB6_OUT27		 = 77,	//!CLB6 OUT27
	ADC_TRIGGER_ECAP1		 = 80,	//!eCAP1
	ADC_TRIGGER_ECAP2		 = 81,	//!eCAP2
	ADC_TRIGGER_ECAP3		 = 82,	//!eCAP3
	ADC_TRIGGER_ECAP4		 = 83,	//!eCAP4
	ADC_TRIGGER_ECAP5		 = 84,	//!eCAP5
	ADC_TRIGGER_ECAP6		 = 85,	//!eCAP6
	ADC_TRIGGER_EPWM13_SOCA		 = 88,	//!ePWM13, ADCSOCA
	ADC_TRIGGER_EPWM13_SOCB		 = 89,	//!ePWM13, ADCSOCB
	ADC_TRIGGER_EPWM14_SOCA		 = 90,	//!ePWM14, ADCSOCA
	ADC_TRIGGER_EPWM14_SOCB		 = 91,	//!ePWM14, ADCSOCB
	ADC_TRIGGER_EPWM15_SOCA		 = 92,	//!ePWM15, ADCSOCA
	ADC_TRIGGER_EPWM15_SOCB		 = 93,	//!ePWM15, ADCSOCB
	ADC_TRIGGER_EPWM16_SOCA		 = 94,	//!ePWM16, ADCSOCA
	ADC_TRIGGER_EPWM16_SOCB		 = 95,	//!ePWM16, ADCSOCB
	ADC_TRIGGER_EPWM17_SOCA		 = 96,	//!ePWM17, ADCSOCA
	ADC_TRIGGER_EPWM17_SOCB		 = 97,	//!ePWM17, ADCSOCB
	ADC_TRIGGER_EPWM18_SOCA		 = 98,	//!ePWM18, ADCSOCA
	ADC_TRIGGER_EPWM18_SOCB		 = 99,	//!ePWM18, ADCSOCB
	ADC_TRIGGER_CPU2_TINT0		 = 100,	//!CPU2 Timer 0, TINT0
	ADC_TRIGGER_CPU2_TINT1		 = 101,	//!CPU2 Timer 1, TINT1
	ADC_TRIGGER_CPU2_TINT2		 = 102,	//!CPU2 Timer 2, TINT2
	ADC_TRIGGER_CPU3_TINT0		 = 103,	//!CPU3 Timer 0, TINT0
	ADC_TRIGGER_CPU3_TINT1		 = 104,	//!CPU3 Timer 1, TINT1
	ADC_TRIGGER_CPU3_TINT2		 = 105,	//!CPU3 Timer 2 TINT2
} ADC_Trigger;


//*****************************************************************************
//
//! Values that can be passed to ADC_setupSOC() as the \e channel
//! parameter. This is the input pin on which the signal to be converted is
//! located.
//
//*****************************************************************************
typedef enum
{
    ADC_CH_ADCIN0  = 0U,          //!< single-ended, ADCIN0
    ADC_CH_ADCIN1  = 1U,          //!< single-ended, ADCIN1
    ADC_CH_ADCIN2  = 2U,          //!< single-ended, ADCIN2
    ADC_CH_ADCIN3  = 3U,          //!< single-ended, ADCIN3
    ADC_CH_ADCIN4  = 4U,          //!< single-ended, ADCIN4
    ADC_CH_ADCIN5  = 5U,          //!< single-ended, ADCIN5
    ADC_CH_ADCIN6  = 6U,          //!< single-ended, ADCIN6
    ADC_CH_ADCIN7  = 7U,          //!< single-ended, ADCIN7
    ADC_CH_ADCIN8  = 8U,          //!< single-ended, ADCIN8
    ADC_CH_ADCIN9  = 9U,          //!< single-ended, ADCIN9
    ADC_CH_ADCIN10 = 10U,         //!< single-ended, ADCIN10
    ADC_CH_ADCIN11 = 11U,         //!< single-ended, ADCIN11
    ADC_CH_ADCIN12 = 12U,         //!< single-ended, ADCIN12
    ADC_CH_ADCIN13 = 13U,         //!< single-ended, ADCIN13
    ADC_CH_ADCIN14 = 14U,         //!< single-ended, ADCIN14
    ADC_CH_ADCIN15 = 15U,         //!< single-ended, ADCIN15
    ADC_CH_ADCIN16 = 16U,         //!< single-ended, ADCIN16
    ADC_CH_ADCIN17 = 17U,         //!< single-ended, ADCIN17
    ADC_CH_ADCIN18 = 18U,         //!< single-ended, ADCIN18
    ADC_CH_ADCIN19 = 19U,         //!< single-ended, ADCIN19
    ADC_CH_ADCIN20 = 20U,         //!< single-ended, ADCIN20
    ADC_CH_ADCIN21 = 21U,         //!< single-ended, ADCIN21
    ADC_CH_ADCIN22 = 22U,         //!< single-ended, ADCIN22
    ADC_CH_ADCIN23 = 23U,         //!< single-ended, ADCIN23
    ADC_CH_ADCIN24 = 24U,         //!< single-ended, ADCIN24
    ADC_CH_ADCIN25 = 25U,         //!< single-ended, ADCIN25
    ADC_CH_ADCIN26 = 26U,         //!< single-ended, ADCIN26
    ADC_CH_ADCIN27 = 27U,         //!< single-ended, ADCIN27
    ADC_CH_ADCIN28 = 28U,         //!< single-ended, ADCIN28
    ADC_CH_ADCIN29 = 29U,         //!< single-ended, ADCIN29
    ADC_CH_ADCIN30 = 30U,         //!< single-ended, ADCIN30
    ADC_CH_ADCIN31 = 31U,         //!< single-ended, ADCIN31
    ADC_CH_ADCIN0_ADCIN1   = 0U,  //!< differential, ADCIN0 and ADCIN1
    ADC_CH_ADCIN2_ADCIN3   = 2U,  //!< differential, ADCIN2 and ADCIN3
    ADC_CH_ADCIN4_ADCIN5   = 4U,  //!< differential, ADCIN4 and ADCIN5
    ADC_CH_ADCIN6_ADCIN7   = 6U,  //!< differential, ADCIN6 and ADCIN7
    ADC_CH_ADCIN8_ADCIN9   = 8U,  //!< differential, ADCIN8 and ADCIN9
    ADC_CH_ADCIN10_ADCIN11 = 10U, //!< differential, ADCIN10 and ADCIN11
    ADC_CH_ADCIN12_ADCIN13 = 12U, //!< differential, ADCIN12 and ADCIN13
    ADC_CH_ADCIN14_ADCIN15 = 14U, //!< differential, ADCIN14 and ADCIN15
    ADC_CH_ADCIN16_ADCIN17 = 16U, //!< differential, ADCIN16 and ADCIN17
    ADC_CH_ADCIN18_ADCIN19 = 18U, //!< differential, ADCIN18 and ADCIN19
    ADC_CH_ADCIN20_ADCIN21 = 20U, //!< differential, ADCIN20 and ADCIN21
    ADC_CH_ADCIN22_ADCIN23 = 22U, //!< differential, ADCIN22 and ADCIN23
    ADC_CH_ADCIN24_ADCIN25 = 24U, //!< differential, ADCIN24 and ADCIN25
    ADC_CH_ADCIN26_ADCIN27 = 26U, //!< differential, ADCIN26 and ADCIN27
    ADC_CH_ADCIN28_ADCIN29 = 28U, //!< differential, ADCIN28 and ADCIN29
    ADC_CH_ADCIN30_ADCIN31 = 30U  //!< differential, ADCIN30 and ADCIN31
} ADC_Channel;

//*****************************************************************************
//
//! Values that can be passed to ADC_setInterruptPulseMode() as the
//! \e pulseMode parameter.
//
//*****************************************************************************
typedef enum
{
    //! Occurs at the end of the acquisition window
    ADC_PULSE_END_OF_ACQ_WIN = 0x00U,
    //! Occurs at the end of the conversion
    ADC_PULSE_END_OF_CONV    = 0x04U
} ADC_PulseMode;

//*****************************************************************************
//
//! Values that can be passed to ADC_enableInterrupt(), ADC_disableInterrupt(),
//! and ADC_getInterruptStatus() as the \e adcIntNum parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_INT_NUMBER1 = 0U,        //!< ADCINT1 Interrupt
    ADC_INT_NUMBER2 = 1U,        //!< ADCINT2 Interrupt
    ADC_INT_NUMBER3 = 2U,        //!< ADCINT3 Interrupt
    ADC_INT_NUMBER4 = 3U         //!< ADCINT4 Interrupt
} ADC_IntNumber;

//*****************************************************************************
//
//! Values that can be passed in as the \e ppbNumber parameter for several
//! functions.
//
//*****************************************************************************
typedef enum
{
    ADC_PPB_NUMBER1 = 0U,        //!< Post-processing block 1
    ADC_PPB_NUMBER2 = 1U,        //!< Post-processing block 2
    ADC_PPB_NUMBER3 = 2U,        //!< Post-processing block 3
    ADC_PPB_NUMBER4 = 3U         //!< Post-processing block 4
} ADC_PPBNumber;

//*****************************************************************************
//
//! Values that can be passed in as the \e socNumber parameter for several
//! functions. This value identifies the start-of-conversion (SOC) that a
//! function is configuring or accessing. Note that in some cases (for example,
//! ADC_setInterruptSource()) \e socNumber is used to refer to the
//! corresponding end-of-conversion (EOC).
//
//*****************************************************************************
typedef enum
{
    ADC_SOC_NUMBER0  = 0U,        //!< SOC/EOC number 0
    ADC_SOC_NUMBER1  = 1U,        //!< SOC/EOC number 1
    ADC_SOC_NUMBER2  = 2U,        //!< SOC/EOC number 2
    ADC_SOC_NUMBER3  = 3U,        //!< SOC/EOC number 3
    ADC_SOC_NUMBER4  = 4U,        //!< SOC/EOC number 4
    ADC_SOC_NUMBER5  = 5U,        //!< SOC/EOC number 5
    ADC_SOC_NUMBER6  = 6U,        //!< SOC/EOC number 6
    ADC_SOC_NUMBER7  = 7U,        //!< SOC/EOC number 7
    ADC_SOC_NUMBER8  = 8U,        //!< SOC/EOC number 8
    ADC_SOC_NUMBER9  = 9U,        //!< SOC/EOC number 9
    ADC_SOC_NUMBER10 = 10U,       //!< SOC/EOC number 10
    ADC_SOC_NUMBER11 = 11U,       //!< SOC/EOC number 11
    ADC_SOC_NUMBER12 = 12U,       //!< SOC/EOC number 12
    ADC_SOC_NUMBER13 = 13U,       //!< SOC/EOC number 13
    ADC_SOC_NUMBER14 = 14U,       //!< SOC/EOC number 14
    ADC_SOC_NUMBER15 = 15U,       //!< SOC/EOC number 15
    ADC_SOC_NUMBER16  = 16U,       //!< SOC/EOC number 16
    ADC_SOC_NUMBER17  = 17U,       //!< SOC/EOC number 17
    ADC_SOC_NUMBER18  = 18U,       //!< SOC/EOC number 18
    ADC_SOC_NUMBER19  = 19U,       //!< SOC/EOC number 19
    ADC_SOC_NUMBER20  = 20U,       //!< SOC/EOC number 20
    ADC_SOC_NUMBER21  = 21U,       //!< SOC/EOC number 21
    ADC_SOC_NUMBER22  = 22U,       //!< SOC/EOC number 22
    ADC_SOC_NUMBER23  = 23U,       //!< SOC/EOC number 23
    ADC_SOC_NUMBER24  = 24U,       //!< SOC/EOC number 24
    ADC_SOC_NUMBER25  = 25U,       //!< SOC/EOC number 25
    ADC_SOC_NUMBER26 = 26U,       //!< SOC/EOC number 26
    ADC_SOC_NUMBER27 = 27U,       //!< SOC/EOC number 27
    ADC_SOC_NUMBER28 = 28U,       //!< SOC/EOC number 28
    ADC_SOC_NUMBER29 = 29U,       //!< SOC/EOC number 29
    ADC_SOC_NUMBER30 = 30U,       //!< SOC/EOC number 30
    ADC_SOC_NUMBER31 = 31U,       //!< SOC/EOC number 31
} ADC_SOCNumber;

//*****************************************************************************
//
//! Values that can be passed in as the \e trigger parameter for the
//! ADC_setInterruptSOCTrigger() function.
//
//*****************************************************************************
typedef enum
{
    ADC_INT_SOC_TRIGGER_NONE    = 0U,   //!< No ADCINT will trigger the SOC
    ADC_INT_SOC_TRIGGER_ADCINT1 = 1U,   //!< ADCINT1 will trigger the SOC
    ADC_INT_SOC_TRIGGER_ADCINT2 = 2U    //!< ADCINT2 will trigger the SOC
} ADC_IntSOCTrigger;

//*****************************************************************************
//
//! Values that can be passed to ADC_setSOCPriority() as the \e priMode
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_PRI_ALL_ROUND_ROBIN  = 0x00,    //!< Round robin mode is used for all
    ADC_PRI_SOC0_HIPRI       = 0x01,    //!< SOC 0 hi pri, others in round robin
    ADC_PRI_THRU_SOC1_HIPRI  = 0x02,    //!< SOC 0-1 hi pri, others in round robin
    ADC_PRI_THRU_SOC2_HIPRI  = 0x03,    //!< SOC 0-2 hi pri, others in round robin
    ADC_PRI_THRU_SOC3_HIPRI  = 0x04,    //!< SOC 0-3 hi pri, others in round robin
    ADC_PRI_THRU_SOC4_HIPRI  = 0x05,    //!< SOC 0-4 hi pri, others in round robin
    ADC_PRI_THRU_SOC5_HIPRI  = 0x06,    //!< SOC 0-5 hi pri, others in round robin
    ADC_PRI_THRU_SOC6_HIPRI  = 0x07,    //!< SOC 0-6 hi pri, others in round robin
    ADC_PRI_THRU_SOC7_HIPRI  = 0x08,    //!< SOC 0-7 hi pri, others in round robin
    ADC_PRI_THRU_SOC8_HIPRI  = 0x09,    //!< SOC 0-8 hi pri, others in round robin
    ADC_PRI_THRU_SOC9_HIPRI  = 0x0A,    //!< SOC 0-9 hi pri, others in round robin
    ADC_PRI_THRU_SOC10_HIPRI = 0x0B,    //!< SOC 0-10 hi pri, others in round robin
    ADC_PRI_THRU_SOC11_HIPRI = 0x0C,    //!< SOC 0-11 hi pri, others in round robin
    ADC_PRI_THRU_SOC12_HIPRI = 0x0D,    //!< SOC 0-12 hi pri, others in round robin
    ADC_PRI_THRU_SOC13_HIPRI = 0x0E,    //!< SOC 0-13 hi pri, others in round robin
    ADC_PRI_THRU_SOC14_HIPRI = 0x0F,    //!< SOC 0-14 hi pri, SOC15 in round robin
    ADC_PRI_THRU_SOC15_HIPRI = 0x10,    //!< SOC 0-15 hi pri, others in round robin
    ADC_PRI_THRU_SOC16_HIPRI = 0x11,    //!< SOC 0-16 hi pri, others in round robin
    ADC_PRI_THRU_SOC17_HIPRI = 0x12,    //!< SOC 0-17 hi pri, others in round robin
    ADC_PRI_THRU_SOC18_HIPRI = 0x13,    //!< SOC 0-18 hi pri, others in round robin
    ADC_PRI_THRU_SOC19_HIPRI = 0x14,    //!< SOC 0-19 hi pri, others in round robin
    ADC_PRI_THRU_SOC20_HIPRI = 0x15,    //!< SOC 0-20 hi pri, others in round robin
    ADC_PRI_THRU_SOC21_HIPRI = 0x16,    //!< SOC 0-21 hi pri, others in round robin
    ADC_PRI_THRU_SOC22_HIPRI = 0x17,    //!< SOC 0-22 hi pri, others in round robin
    ADC_PRI_THRU_SOC23_HIPRI = 0x18,    //!< SOC 0-23 hi pri, others in round robin
    ADC_PRI_THRU_SOC24_HIPRI = 0x19,    //!< SOC 0-24 hi pri, others in round robin
    ADC_PRI_THRU_SOC25_HIPRI = 0x1A,    //!< SOC 0-25 hi pri, others in round robin
    ADC_PRI_THRU_SOC26_HIPRI = 0x1B,    //!< SOC 0-26 hi pri, others in round robin
    ADC_PRI_THRU_SOC27_HIPRI = 0x1C,    //!< SOC 0-27 hi pri, others in round robin
    ADC_PRI_THRU_SOC28_HIPRI = 0x1D,    //!< SOC 0-28 hi pri, others in round robin
    ADC_PRI_THRU_SOC29_HIPRI = 0x1E,    //!< SOC 0-29 hi pri, others in round robin
    ADC_PRI_THRU_SOC30_HIPRI = 0x1F,    //!< SOC 0-30 hi pri, others in round robin
    ADC_PRI_ALL_HIPRI        = 0x20     //!< All priorities based on SOC number
} ADC_PriorityMode;

//*****************************************************************************
//
//! Values that can be passed to ADC_getTemperatureC(), ADC_getTemperatureK(),
//! ADC_setVREF() and ADC_setOffsetTrimAll() as the \e refMode parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_REFERENCE_INTERNAL = 0U,
    ADC_REFERENCE_EXTERNAL = 1U
} ADC_ReferenceMode;

//*****************************************************************************
//
//! Values that can be passed to ADC_configOSDetectMode() as the \e modeVal
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_OSDETECT_MODE_DISABLED            = 0x0U,//!< Open/Shorts detection cir-
                                                 //!< cuit(O/S DC) is disabled
    ADC_OSDETECT_MODE_VSSA                = 0x1U,//!< O/S DC is enabled at zero
                                                 //!< scale
    ADC_OSDETECT_MODE_VDDA                = 0x2U,//!< O/S DC is enabled at full
                                                 //!< scale
    ADC_OSDETECT_MODE_5BY12_VDDA          = 0x3U,//!< O/S DC is enabled at 5/12
                                                 //!< scale
    ADC_OSDETECT_MODE_7BY12_VDDA          = 0x4U,//!< O/S DC is enabled at 7/12
                                                 //!< scale
    ADC_OSDETECT_MODE_5K_PULLDOWN_TO_VSSA = 0x5U,//!< O/S DC is enabled at 5K
                                                 //!< pulldown to VSSA
    ADC_OSDETECT_MODE_5K_PULLUP_TO_VDDA   = 0x6U,//!< O/S DC is enabled at 5K
                                                 //!< pullup to VDDA
    ADC_OSDETECT_MODE_7K_PULLDOWN_TO_VSSA = 0x7U //!< O/S DC is enabled at 7K
                                                 //!< pulldown to VSSA
} ADC_OSDetectMode;

//*****************************************************************************
//
//! Values that can be passed to ADC_selectOffsetTrimMode() as the
//! \e mode parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_OFFSET_TRIM_COMMON     = 0x0000U, //!< Common Trim register for all
                                          //!< ADC modes
    ADC_OFFSET_TRIM_INDIVIDUAL = 0x0100U  //!< Individual Trim registers for
                                          //!< different ADC modes
} ADC_OffsetTrim;

//*****************************************************************************
//
//! Values that can be passed to ADC_setupSOCRefloChannel() as the
//! \e channelType parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_CHANNEL_ODD     = 0U, //!< ADC Odd Channel
    ADC_CHANNEL_EVEN    = 1U  //!< ADC Even Channel
} ADC_ChannelType;

//*****************************************************************************
//
//! Values that can be passed to ADC_selectPPBSyncInput() and
//! ADC_triggerRepeaterSyncIn() as the \e syncInput parameter.
//
//*****************************************************************************

