TexasInstruments/f29h85x-sdk/source/driverlib/adc.h
typedef enum
{
	ADC_SYNCIN_DISABLE		 = 0x0,	//!ADC Syncin is disabled
	ADC_SYNCIN_EPWM1SYNCOUT		 = 0x1,	//!ADC Syncin is EPWM1SYNCOUT
	ADC_SYNCIN_EPWM2SYNCOUT		 = 0x2,	//!ADC Syncin is EPWM2SYNCOUT
	ADC_SYNCIN_EPWM3SYNCOUT		 = 0x3,	//!ADC Syncin is EPWM3SYNCOUT
	ADC_SYNCIN_EPWM4SYNCOUT		 = 0x4,	//!ADC Syncin is EPWM4SYNCOUT
	ADC_SYNCIN_EPWM5SYNCOUT		 = 0x5,	//!ADC Syncin is EPWM5SYNCOUT
	ADC_SYNCIN_EPWM6SYNCOUT		 = 0x6,	//!ADC Syncin is EPWM6SYNCOUT
	ADC_SYNCIN_EPWM7SYNCOUT		 = 0x7,	//!ADC Syncin is EPWM7SYNCOUT
	ADC_SYNCIN_EPWM8SYNCOUT		 = 0x8,	//!ADC Syncin is EPWM8SYNCOUT
	ADC_SYNCIN_EPWM9SYNCOUT		 = 0x9,	//!ADC Syncin is EPWM9SYNCOUT
	ADC_SYNCIN_EPWM10SYNCOUT		 = 0xA,	//!ADC Syncin is EPWM10SYNCOUT
	ADC_SYNCIN_EPWM11SYNCOUT		 = 0xB,	//!ADC Syncin is EPWM11SYNCOUT
	ADC_SYNCIN_EPWM12SYNCOUT		 = 0xC,	//!ADC Syncin is EPWM12SYNCOUT
	ADC_SYNCIN_EPWM13SYNCOUT		 = 0xD,	//!ADC Syncin is EPWM13SYNCOUT
	ADC_SYNCIN_EPWM14SYNCOUT		 = 0xE,	//!ADC Syncin is EPWM14SYNCOUT
	ADC_SYNCIN_EPWM15SYNCOUT		 = 0xF,	//!ADC Syncin is EPWM15SYNCOUT
	ADC_SYNCIN_EPWM16SYNCOUT		 = 0x10,	//!ADC Syncin is EPWM16SYNCOUT
	ADC_SYNCIN_EPWM17SYNCOUT		 = 0x11,	//!ADC Syncin is EPWM17SYNCOUT
	ADC_SYNCIN_EPWM18SYNCOUT		 = 0x12,	//!ADC Syncin is EPWM18SYNCOUT
	ADC_SYNCIN_ECAP1YNCOUT		 = 0x13,	//!ADC Syncin is ECAP1YNCOUT
	ADC_SYNCIN_ECAP2SYNCOUT		 = 0x14,	//!ADC Syncin is ECAP2SYNCOUT
	ADC_SYNCIN_ECAP3SYNCOUT		 = 0x15,	//!ADC Syncin is ECAP3SYNCOUT
	ADC_SYNCIN_ECAP4SYNCOUT		 = 0x16,	//!ADC Syncin is ECAP4SYNCOUT
	ADC_SYNCIN_ECAP5SYNCOUT		 = 0x17,	//!ADC Syncin is ECAP5SYNCOUT
	ADC_SYNCIN_ECAP6SYNCOUT		 = 0x18,	//!ADC Syncin is ECAP6SYNCOUT
	ADC_SYNCIN_INPUTXBAROUTPUT5		 = 0x1A,	//!ADC Syncin is INPUTXBAROUTPUT5
	ADC_SYNCIN_INPUTXBAROUTPUT6		 = 0x1B,	//!ADC Syncin is INPUTXBAROUTPUT6
	ADC_SYNCIN_EtherCATSYNC0		 = 0x1C,	//!ADC Syncin is EtherCATSYNC0
	ADC_SYNCIN_EtherCATSYNC1		 = 0x1D	//!ADC Syncin is EtherCATSYNC1
} ADC_SyncInput;


//*****************************************************************************
//
//! Values that can be passed to ADC_selectPPBOSINTSource() as the \e osIntSrc
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_PPB_OS_INT_1 = 0x0U,          //!< PCount generates PPB interrupt
    ADC_PPB_OS_INT_2 = 0x1U,          //!< PCount/Sync generates PPB interrupt
} ADC_PPBIntSrcSelect;

//*****************************************************************************
//
//! Values that can be passed to ADC_selectSOCExtChannel() as the \e extChannel
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_CH_ADCINX_0  = 0x0U,          //!< ADCINX.0 is converted
    ADC_CH_ADCINX_1  = 0x1U,          //!< ADCINX.1 is converted
    ADC_CH_ADCINX_2  = 0x2U,          //!< ADCINX.2 is converted
    ADC_CH_ADCINX_3  = 0x3U,          //!< ADCINX.3 is converted
    ADC_CH_ADCINX_4  = 0x4U,          //!< ADCINX.4 is converted
    ADC_CH_ADCINX_5  = 0x5U,          //!< ADCINX.5 is converted
    ADC_CH_ADCINX_6  = 0x6U,          //!< ADCINX.6 is converted
    ADC_CH_ADCINX_7  = 0x7U,          //!< ADCINX.7 is converted
    ADC_CH_ADCINX_8  = 0x8U,          //!< ADCINX.8 is converted
    ADC_CH_ADCINX_9  = 0x9U,          //!< ADCINX.9 is converted
    ADC_CH_ADCINX_10 = 0xAU,          //!< ADCINX.10 is converted
    ADC_CH_ADCINX_11 = 0xBU,          //!< ADCINX.11 is converted
    ADC_CH_ADCINX_12 = 0xCU,          //!< ADCINX.12 is converted
    ADC_CH_ADCINX_13 = 0xDU,          //!< ADCINX.13 is converted
    ADC_CH_ADCINX_14 = 0xEU,          //!< ADCINX.14 is converted
    ADC_CH_ADCINX_15 = 0xFU           //!< ADCINX.15 is converted
} ADC_ExtChannel;

//*****************************************************************************
//
//! Values that can be passed to ADC_setInterruptSource() as the \e intTrigger
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_INT_TRIGGER_EOC0   = 0x00,        //!< SOC/EOC0
    ADC_INT_TRIGGER_EOC1   = 0x01,        //!< SOC/EOC1
    ADC_INT_TRIGGER_EOC2   = 0x02,        //!< SOC/EOC2
    ADC_INT_TRIGGER_EOC3   = 0x03,        //!< SOC/EOC3
    ADC_INT_TRIGGER_EOC4   = 0x04,        //!< SOC/EOC4
    ADC_INT_TRIGGER_EOC5   = 0x05,        //!< SOC/EOC5
    ADC_INT_TRIGGER_EOC6   = 0x06,        //!< SOC/EOC6
    ADC_INT_TRIGGER_EOC7   = 0x07,        //!< SOC/EOC7
    ADC_INT_TRIGGER_EOC8   = 0x08,        //!< SOC/EOC8
    ADC_INT_TRIGGER_EOC9   = 0x09,        //!< SOC/EOC9
    ADC_INT_TRIGGER_EOC10  = 0x0A,       //!< SOC/EOC10
    ADC_INT_TRIGGER_EOC11  = 0x0B,       //!< SOC/EOC11
    ADC_INT_TRIGGER_EOC12  = 0x0C,       //!< SOC/EOC12
    ADC_INT_TRIGGER_EOC13  = 0x0D,       //!< SOC/EOC13
    ADC_INT_TRIGGER_EOC14  = 0x0E,       //!< SOC/EOC14
    ADC_INT_TRIGGER_EOC15  = 0x0F,       //!< SOC/EOC15
    ADC_INT_TRIGGER_EOC16  = 0x10,        //!< SOC/EO16
    ADC_INT_TRIGGER_EOC17  = 0x11,        //!< SOC/EO17
    ADC_INT_TRIGGER_EOC18  = 0x12,        //!< SOC/EO18
    ADC_INT_TRIGGER_EOC19  = 0x13,        //!< SOC/EOC19
    ADC_INT_TRIGGER_EOC20  = 0x14,        //!< SOC/EOC20
    ADC_INT_TRIGGER_EOC21  = 0x15,        //!< SOC/EOC21
    ADC_INT_TRIGGER_EOC22  = 0x16,        //!< SOC/EOC22
    ADC_INT_TRIGGER_EOC23  = 0x17,        //!< SOC/EOC23
    ADC_INT_TRIGGER_EOC24  = 0x18,        //!< SOC/EOC24
    ADC_INT_TRIGGER_EOC25  = 0x19,        //!< SOC/EOC25
    ADC_INT_TRIGGER_EOC26  = 0x1A,       //!< SOC/EOC26
    ADC_INT_TRIGGER_EOC27  = 0x1B,       //!< SOC/EOC27
    ADC_INT_TRIGGER_EOC28  = 0x1C,       //!< SOC/EOC28
    ADC_INT_TRIGGER_EOC29  = 0x1D,       //!< SOC/EOC29
    ADC_INT_TRIGGER_EOC30  = 0x1E,       //!< SOC/EOC30
    ADC_INT_TRIGGER_EOC31  = 0x1F,       //!< SOC/EOC31
    ADC_INT_TRIGGER_OSINT1 = 0x20,       //!< OSINT1
    ADC_INT_TRIGGER_OSINT2 = 0x21,       //!< OSINT2
    ADC_INT_TRIGGER_OSINT3 = 0x22,       //!< OSINT3
    ADC_INT_TRIGGER_OSINT4 = 0x23        //!< OSINT4
} ADC_IntTrigger;

//*****************************************************************************
//
//! Values that can be passed to ADC_selectPPBCompareSource() as the \e compSrc
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_PPB_COMPSOURCE_RESULT = 0x0U,   //!< PPB compare source is ADCRESULT
    ADC_PPB_COMPSOURCE_PSUM   = 0x1U,   //!< PPB compare source is PSUM
    ADC_PPB_COMPSOURCE_SUM    = 0x2U    //!< PPB compare source is SUM
} ADC_PPBCompSource;

//*****************************************************************************
//
//! Values that can be passed to ADC_configureSafetyChecker() as the
//! \e adcInst parameter.
//
//*****************************************************************************
typedef enum
{
     ADC_A = 0U,                        //!< Select ADCA instance
     ADC_B = 1U,                        //!< Select ADCB instance
     ADC_C = 2U,
     ADC_D = 3U,
     ADC_E = 4U                         //!< Select ADCC instance
} ADC_Select;

//*****************************************************************************
//
//! Values that can be passed to ADC_configureSafetyChecker() as the
//! \e adcResultInst parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_RESULT0  = 0U,                  //!< Select ADC Result 0
    ADC_RESULT1  = 1U,                  //!< Select ADC Result 1
    ADC_RESULT2  = 2U,                  //!< Select ADC Result 2
    ADC_RESULT3  = 3U,                  //!< Select ADC Result 3
    ADC_RESULT4  = 4U,                  //!< Select ADC Result 4
    ADC_RESULT5  = 5U,                  //!< Select ADC Result 5
    ADC_RESULT6  = 6U,                  //!< Select ADC Result 6
    ADC_RESULT7  = 7U,                  //!< Select ADC Result 7
    ADC_RESULT8  = 8U,                  //!< Select ADC Result 8
    ADC_RESULT9  = 9U,                  //!< Select ADC Result 9
    ADC_RESULT10 = 10U,                 //!< Select ADC Result 10
    ADC_RESULT11 = 11U,                 //!< Select ADC Result 11
    ADC_RESULT12 = 12U,                 //!< Select ADC Result 12
    ADC_RESULT13 = 13U,                 //!< Select ADC Result 13
    ADC_RESULT14 = 14U,                 //!< Select ADC Result 14
    ADC_RESULT15 = 15U,                 //!< Select ADC Result 15
    ADC_RESULT16 = 16U,                 //!< Select ADC Result 16
    ADC_RESULT17 = 17U,                 //!< Select ADC Result 17
    ADC_RESULT18 = 18U,                 //!< Select ADC Result 18
    ADC_RESULT19 = 19U,                 //!< Select ADC Result 19
    ADC_RESULT20 = 20U,                 //!< Select ADC Result 20
    ADC_RESULT21 = 21U,                 //!< Select ADC Result 21
    ADC_RESULT22 = 22U,                 //!< Select ADC Result 22
    ADC_RESULT23 = 23U,                 //!< Select ADC Result 23
    ADC_RESULT24 = 24U,                 //!< Select ADC Result 24
    ADC_RESULT25 = 25U,                 //!< Select ADC Result 25
    ADC_RESULT26 = 26U,                 //!< Select ADC Result 26
    ADC_RESULT27 = 27U,                 //!< Select ADC Result 27
    ADC_RESULT28 = 28U,                 //!< Select ADC Result 28
    ADC_RESULT29 = 29U,                 //!< Select ADC Result 29
    ADC_RESULT30 = 30U,                 //!< Select ADC Result 30
    ADC_RESULT31 = 31U                  //!< Select ADC Result 31
} ADC_ResultSelect;

//*****************************************************************************
//
//! Values that can be passed to ADC_configSOCSafetyCheckerInput() as the
//! \e scInput parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_SAFETY_CHECKER_INPUT_DISABLE  = 0x0U, //!< Safety checker i/p disabled
    ADC_SAFETY_CHECKER_INPUT_SOCx     = 0x1U, //!< Safety checker i/p is SOCx
    ADC_SAFETY_CHECKER_INPUT_PPBx     = 0x2U, //!< Safety checker i/p is PPBx
    ADC_SAFETY_CHECKER_INPUT_PPBSUMx  = 0x3U  //!< Safety checker i/p is PPBSUMx
} ADC_SafetyCheckerInput;

//*****************************************************************************
//
//! Values that can be passed to ADC_getSafetyCheckerResult() as
//! \e checkInst parameter.
//
//*****************************************************************************
typedef enum
{
  ADC_SAFETY_CHECK1  = 0x0U,            //!< Safety Check Result 1
  ADC_SAFETY_CHECK2  = 0x2U             //!< Safety Check Result 2
} ADC_SafetyCheckInst;

//*****************************************************************************
//
//! Values that can be passed to ADC_enableSafetyCheckEvt() and
//! ADC_disableSafetyCheckEvt() as \e checkEvent parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_SAFETY_CHECK_EVENT1 = 0U,       //!< Safety Check Event 1
    ADC_SAFETY_CHECK_EVENT2 = 8U,       //!< Safety Check Event 2
    ADC_SAFETY_CHECK_EVENT3 = 16U,      //!< Safety Check Event 3
    ADC_SAFETY_CHECK_EVENT4 = 24U       //!< Safety Check Event 4
} ADC_SafetyCheckEvent;

//*****************************************************************************
//
//! Values that can be passed to ADC_enableSafetyCheckEvt(),
//! ADC_disableSafetyCheckEvt(), ADC_enableSafetyCheckInt() and
//! ADC_disableSafetyCheckInt() as \e checkResult parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_SAFETY_CHECK_RES1OVF = 0U,      //!< Safety Check Result1 Overflow
    ADC_SAFETY_CHECK_RES2OVF = 2U,      //!< Safety Check Result2 Overflow
    ADC_SAFETY_CHECK_OOT     = 4U       //!< Safety Check OOT
} ADC_SafetyCheckResult;

//*****************************************************************************
//
//! Values that can be passed to ADC_enableSafetyCheckEvt(),
//! ADC_disableSafetyCheckEvt(), ADC_enableSafetyCheckInt(),
//! ADC_disableSafetyCheckInt(), ADC_getSafetyCheckStatus(),
//! ADC_clearSafetyCheckStatus(), ADC_getSafetyCheckIntStatus() and
//! ADC_clearSafetyCheckIntStatus() as \e checkerNumber parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_SAFETY_CHECKER1 = 0U,           //!< Safety Checker1
    ADC_SAFETY_CHECKER2 = 1U,           //!< Safety Checker2
    ADC_SAFETY_CHECKER3 = 2U,           //!< Safety Checker3
    ADC_SAFETY_CHECKER4 = 3U,           //!< Safety Checker4
    ADC_SAFETY_CHECKER5 = 4U,           //!< Safety Checker5
    ADC_SAFETY_CHECKER6 = 5U,           //!< Safety Checker6
    ADC_SAFETY_CHECKER7 = 6U,           //!< Safety Checker7
    ADC_SAFETY_CHECKER8 = 7U            //!< Safety Checker8
}ADC_Checker;

//*****************************************************************************
//
//! Values that can be passed to ADC_getSafetyCheckStatus() and
//! ADC_clearSafetyCheckStatus(), as \e checkerFlag parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_SAFETY_CHECK_OOT_FLG     = 0U,  //!< Safety Check Out-of-Tolerance Flag
    ADC_SAFETY_CHECK_RES1OVF_FLG = 4U,  //!< Safety Check Result1 Overflow Flag
    ADC_SAFETY_CHECK_RES2OVF_FLG = 8U   //!< Safety Check Result2 Overflow Flag
}ADC_SafetyCheckFlag;


//*****************************************************************************
//
//! Values that can be passed to ADC_configureRepeater() as the \e repInstance
//! parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_REPINST1 = 0x0U,                //!< Select ADC repeater instance 1
    ADC_REPINST2 = 0x1U                 //!< Select ADC repeater instance 2
} ADC_RepInstance;

//*****************************************************************************
//
//! Values that can be passed to ADC_configureRepeater() as the
//! \e config.repMode and ADC_triggerRepeaterMode() as \e mode parameter.
//
//*****************************************************************************
typedef enum
{
    ADC_REPMODE_OVERSAMPLING   = 0x0U,  //!< ADC repeater mode is oversampling
    ADC_REPMODE_UNDERSAMPLING  = 0x1U   //!< ADC repeater mode is undersampling
} ADC_RepMode;

//*****************************************************************************
//
//! Values that can be passed to ADC_configureRepeater() as the
//! \e config parameter.
//
//*****************************************************************************
typedef struct
{
    ADC_RepMode repMode;     //!< Repeater Mode
    ADC_Trigger repTrigger;  //!< Repeater Trigger
    ADC_SyncInput repSyncin; //!< Repeater Syncin
    uint16_t repCount;       //!< Repeater trigger count
    uint16_t repPhase;       //!< Repeater trigger phase delay in sysclk cycles
    uint16_t repSpread;      //!< Repeater trigger spread in sysclk cycles
} ADC_RepeaterConfig;

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//*****************************************************************************
//
//! \internal
//! Checks an ADC base address.
//!
//! \param base specifies the ADC module base address.
//!
//! This function determines if a ADC module base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool
ADC_isBaseValid(uint32_t base)
{

    return (
           ((base & BASE_ADDR_MASK) == ADCA_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCB_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCC_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCD_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCE_BASE_FRAME(0U))
          );
}
#endif

//*****************************************************************************
//
//! Configures the analog-to-digital converter module prescaler.
//!
//! \param base is the base address of the ADC module.
//! \param clkPrescale is the ADC clock prescaler.
//!
//! This function configures the ADC module's ADCCLK.
//!
//! The \e clkPrescale parameter specifies the value by which the input clock
//! is divided to make the ADCCLK.  The clkPrescale value can be specified with
//! any of the following enum values:
//! \b ADC_CLK_DIV_1_0, \b ADC_CLK_DIV_2_0, \b ADC_CLK_DIV_2_5, ...,
//! \b ADC_CLK_DIV_7_5, \b ADC_CLK_DIV_8_0, or \b ADC_CLK_DIV_8_5.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ADC_setPrescaler(uint32_t base, ADC_ClkPrescale clkPrescale)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isBaseValid(base));

    //
    // Set the configuration of the ADC module prescaler.
    //

    HWREGH(base + ADC_O_CTL2) = (HWREGH(base + ADC_O_CTL2) &
                                 ~ADC_CTL2_PRESCALE_M) | (uint16_t)clkPrescale;

