TexasInstruments/f29h85x-sdk/source/driverlib/adc.h
}

//*****************************************************************************
//
//! Converts temperature from sensor reading to degrees C
//!
//! \param tempResult is the raw ADC A conversion result from the temp sensor.
//! \param vref is the reference voltage being used (for example 3.3 for 3.3V).
//! \param refMode is the reference mode being used (\b ADC_REFERENCE_INTERNAL
//!        or \b ADC_REFERENCE_EXTERNAL).
//!
//! This function converts temperature from temp sensor reading to degrees C.
//! Temp sensor values in production test are derived with 2.5V reference.
//! The \b vref argument in the function is used to scale the temp sensor
//! reading accordingly if temp sensor value is read at a different VREF
//! setting.
//!
//! \return Returns the temperature sensor reading converted to degrees C.
//
//*****************************************************************************
static inline int16_t
ADC_getTemperatureC(uint16_t tempResult, ADC_ReferenceMode refMode,
                        float32_t vref)
{
    float32_t temp;

    //
    // Read temp sensor slope and offset locations from OTP and convert
    //
    temp = (float32_t)tempResult * (vref / 2.5F);
    if(refMode == ADC_REFERENCE_INTERNAL)
    {
        return((int16_t)((((int32_t)temp - ADC_INT_REF_TSOFFSET) * 4096) /
                         ADC_INT_REF_TSSLOPE));
    }
    else
    {
        return((int16_t)((((int32_t)temp - ADC_EXT_REF_TSOFFSET) * 4096) /
                         ADC_EXT_REF_TSSLOPE));
    }
}

//*****************************************************************************
//
//! Converts temperature from sensor reading to degrees K
//!
//! \param tempResult is the raw ADC A conversion result from the temp sensor.
//! \param vref is the reference voltage being used (for example 3.3 for 3.3V).
//! \param refMode is the reference mode being used (\b ADC_REFERENCE_INTERNAL
//!        or \b ADC_REFERENCE_EXTERNAL).
//!
//! This function converts temperature from temp sensor reading to degrees K.
//! Temp sensor values in production test are derived with 2.5V reference.
//! The \b vref argument in the function is used to scale the temp sensor
//! reading accordingly if temp sensor value is read at a different VREF
//! setting.
//!
//! \return Returns the temperature sensor reading converted to degrees K.
//
//*****************************************************************************
static inline int16_t
ADC_getTemperatureK(uint16_t tempResult, ADC_ReferenceMode refMode,
                        float32_t vref)
{
    float32_t temp;

    //
    // Read temp sensor slope and offset locations from OTP and convert
    //
    temp = (float32_t)tempResult * (vref / 2.5F);
    if(refMode == ADC_REFERENCE_INTERNAL)
    {
        return((int16_t)(((((int32_t)temp - ADC_INT_REF_TSOFFSET) * 4096) /
                         ADC_INT_REF_TSSLOPE) + 273));
    }
    else
    {
        return((int16_t)(((((int32_t)temp - ADC_EXT_REF_TSOFFSET) * 4096) /
                         ADC_EXT_REF_TSSLOPE) + 273));
    }
}
//*****************************************************************************
//
//! Configures the safety checker result for a selected SOC.
//!
//! \param base is the base address of the ADC module.
//! \param socNumber is the number of the start-of-conversion.
//! \param scInput is the desired input configuration.
//!
//! This function configures the safety checker input for the desired SOC.
//!
//! The \e socNumber number is a value \b ADC_SOC_NUMBERX where X is a number
//! from 0 to 15 specifying which SOC is to be configured on the ADC module
//! specified by \e base.
//!
//! The \e scInput is the desired safety checker input configuration.
//! Valid values can be refered from the enum \e ADC_SafetyCheckerInput.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ADC_configSOCSafetyCheckerInput(uint32_t base, ADC_SOCNumber socNumber,
                                ADC_SafetyCheckerInput scInput)
{
    uint32_t socShift;

    //
    // Check the arguments.
    //
    ASSERT(ADC_isBaseValid(base));

    uint32_t regOffset = ADC_O_SAFECHECKRESEN;

    if(socNumber >= ADC_SOC_NUMBER16)
    {
        socNumber = (ADC_SOCNumber)(socNumber - ADC_SOC_NUMBER16);;
        regOffset = ADC_O_SAFECHECKRESEN2;
    }

    //
    // Calculate the SOC shift.
    //
    socShift = ((uint32_t)socNumber * 2UL);

    //
    // Configure the Safety Checker Result mode.
    //
    HWREG(base + regOffset) =
                          (HWREG(base + regOffset)             &
                           ~(ADC_SAFECHECKRESEN_SOC0CHKEN_M << socShift)) |
                          ((uint32_t)scInput << socShift);
}

//
// ADC_SAFECHECK_REGS
//*****************************************************************************
//
//! \internal
//! Checks the Safety Checker base address.
//!
//! \param base specifies the ADC Safety Checker module base address.
//!
//! This function determines if a ADC Safety Checker module base address is
//! valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool
ADC_isSafetyCheckerBaseValid(uint32_t base)
{
   return(
           ((base & BASE_ADDR_MASK) == ADCSAFETYCHECK1_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCSAFETYCHECK2_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCSAFETYCHECK3_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCSAFETYCHECK4_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCSAFETYCHECK5_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCSAFETYCHECK6_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCSAFETYCHECK7_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCSAFETYCHECK8_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCSAFETYCHECK9_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCSAFETYCHECK10_BASE_FRAME(0U))
          );
}
#endif

//*****************************************************************************
//
//! Enables the ADC result safety checker module.
//!
//! \param scBase is the base address of the ADC Safety Checker module.
//!
//! This function enables the ADC result safety checker module.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ADC_enableSafetyChecker(uint32_t scBase)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafetyCheckerBaseValid(scBase));

    //
    // Enable the Saftey Checker module
    //
    HWREGH(scBase + ADC_O_CHECKCONFIG) |= ADC_CHECKCONFIG_CHKEN;
}

//*****************************************************************************
//
//! Disables the ADC result safety checker module.
//!
//! \param scBase is the base address of the ADC Safety Checker module.
//!
//! This function disables the ADC result safety checker module.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ADC_disableSafetyChecker(uint32_t scBase)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafetyCheckerBaseValid(scBase));

    //
    // Disable the Saftey Checker module.
    //
    HWREGH(scBase + ADC_O_CHECKCONFIG) &= ~ADC_CHECKCONFIG_CHKEN;
}

//*****************************************************************************
//
//! Forces the software sync for the safety checker module
//!
//! \param scBase is the base address of the safety checker module.
//!
//! This function forces the software sync for the safety checker module.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ADC_forceSafetyCheckerSync(uint32_t scBase)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafetyCheckerBaseValid(scBase));

    //
    // Force software sync for the safety checker module.
    //
    HWREGH(scBase + ADC_O_CHECKCONFIG) |= ADC_CHECKCONFIG_SWSYNC;
}

//*****************************************************************************
//
//! Returns the status of the safey checker module.
//!
//! \param scBase is the base address of the ADC safety checker module.
//!
//! This function configures the external channel for an SOC by configuring
//! the external channel mux for an SOC.
//!
//! \return Returns the status of the safety checker module. Valid values
//! are any of the follwing values or any of their OR'd combination:
//! - \e ADC_SAFECHECK_RESULT1_READY
//! - \e ADC_SAFECHECK_RESULT2_READY
//! - \e ADC_SAFECHECK_RESULT1_OOT
//
//*****************************************************************************
static inline uint16_t
ADC_getSafetyCheckerStatus(uint32_t scBase)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafetyCheckerBaseValid(scBase));

    //
    // Returns Safety Checker module status
    //
    return(HWREGH(scBase + ADC_O_CHECKSTATUS) & ADC_SAFECHECK_STATUS_MASK);
}

//*****************************************************************************
//
//! Configures the safety checker module.
//!
//! \param scBase is the base address of the ADC safety checker module.
//! \param scInst is the safety checker instance to be configured.
//! \param adcInst is the desired ADC instance.
//! \param adcResultInst is the desired ADC result instance.
//!
//! This function configures the selected checker instance of a safety checker
//! instance.
//!
//! The \e checkInst parameter can take values defined by enum
//! \b ADC_SafetyCheckInst. The \e adcInst parameter can take values defined
//! by enum \b ADC_Select. The \e adcResultInst parameter can take values
//! defined by enum \b ADC_ResultSelect.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ADC_configureSafetyChecker(uint32_t scBase, ADC_SafetyCheckInst checkInst,
                           ADC_Select adcInst, ADC_ResultSelect adcResultInst)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafetyCheckerBaseValid(scBase));

    //
    // Configure safety checker instance
    //
    HWREGH(scBase + ADC_O_RESSEL1 + (uint16_t)checkInst * 2U) =
                        (HWREGH(scBase + ADC_O_RESSEL1 + (uint16_t)checkInst * 2U) &
                        (ADC_RESSEL1_ADCSEL_M | ADC_RESSEL1_ADCRESULTSEL_M)) |
                        (((uint16_t)adcInst << ADC_RESSEL1_ADCSEL_S) |
                         ((uint16_t)adcResultInst << ADC_RESSEL1_ADCRESULTSEL_S));
}

//*****************************************************************************
//
//! Configures the tolerance allowed between safety check results.
//!
//! \param scBase is the base address of the ADC module.
//! \param tolerance is the number of the start-of-conversion.
//!
//! This function configures the tolerance for the difference between
//! check result instances of the selected safety checker instance.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ADC_setSafetyCheckerTolerance(uint32_t scBase, uint32_t tolerance)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafetyCheckerBaseValid(scBase));
    ASSERT(tolerance <= ADC_TOLERANCE_TOLERANCE_M);

    //
    // Set safety checker tolerance
    //
    HWREGH(scBase + ADC_O_TOLERANCE) = (tolerance & ADC_TOLERANCE_TOLERANCE_M);
}

//*****************************************************************************
//
//! Returns the safety check result for the selected instance.
//!
//! \param scBase is the base address of the ADC module.
//! \param checkInst is the number of the start-of-conversion.
//!
//! This function returns the safety check result for the selected instance.
//!
//! The \e checkInst number is a value \b ADC_SAFETY_CHECKx where x is a number
//! from 1 to 2 specifying the safety result check instances available in the
//! safety checker instance specified by \e scBase.
//!
//!
//! \return Returns the safety checker result for the desired instance.
//
//*****************************************************************************
static inline uint32_t
ADC_getSafetyCheckerResult(uint32_t scBase, ADC_SafetyCheckInst checkInst)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafetyCheckerBaseValid(scBase));

    //
    // Returns the safety check result for the selected instance
    //
    return(HWREG(scBase + ADC_O_CHECKRESULT1 + (uint16_t)checkInst * 2U) &
           ADC_CHECKRESULT1_RESULT_M);
}

//
// ADC_SAFECHECK_INTEVT_REGS
//*****************************************************************************
//
//! \internal
//! Checks the Safety Checker INTEVT base address.
//!
//! \param base specifies the ADC Safety Checker INTEVT module base address.
//!
//! This function determines if a ADC Safety Checker INTEVT module base address
//! is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool
ADC_isSafeCheckINTEVTBaseValid(uint32_t base)
{

    return(
           ((base & BASE_ADDR_MASK) == ADCSAFETYCHECKINTEVT1_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCSAFETYCHECKINTEVT2_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == ADCSAFETYCHECKINTEVT3_BASE_FRAME(0U))
          );
}
#endif

//*****************************************************************************
//
//! Enables the safety checker event sources for selected instance.
//!
//! \param scIntEvtBase is the base address of ADC Safe Check INTEVT module.
//! \param checkResult is the desired ADC Safety Checker result.
//! \param checkEvent is the desired event number.
//! \param checkerNumber is the number of the checker tile.
//!
//! This function enables the indicated safety checker event sources.
//!
//! The \e checkResult specifies the result of the OOT or OVF events. It should
//! be one of the following values.
//!
//! - \b ADC_SAFETY_CHECK_RESULT1
//! - \b ADC_SAFETY_CHECK_RESULT2
//! - \b ADC_SAFETY_CHECK_OOT
//!
//! The \e checkEvent is a value \b ADC_SAFETY_CHECK_EVENTx where x is
//! a number from 1 to 4 specifying the safety check events available in
//! the safety checker specified by \e scIntEvtBase.
//!
//! The \e checkerNumber number is a value \b ADC_SAFETY_CHECKERx where x is
//! a number from 1 to 8 specifying which Checker Tile is to be selected in
//! the ADC module.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ADC_enableSafetyCheckEvt(uint32_t scIntEvtBase, ADC_Checker checkerNumber,
            ADC_SafetyCheckEvent checkEvent, ADC_SafetyCheckResult checkResult)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafeCheckINTEVTBaseValid(scIntEvtBase));

    //
    // Enables the safety checker event source.
    //
    HWREG(scIntEvtBase + ADC_O_CHECKEVT1SEL1 + ((uint32_t)checkEvent +
                    (uint32_t)checkResult) * 2UL) |= (1UL << (uint32_t)checkerNumber);
}

//*****************************************************************************
//
//! Disables the safety checker event sources for selected instance.
//!
//! \param scIntEvtBase is the base address of ADC Safe Check INTEVT module.
//! \param checkResult is the desired ADC Safety Checker result.
//! \param checkEvent is the desired event number.
//! \param checkerNumber is the number of the checker tile.
//!
//! This function disables the indicated safety checker event sources.
//!
//! The \e checkResult specifies the result of the OOT or OVF events. It should
//! be one of the following values.
//!
//! - \b ADC_SAFETY_CHECK_RESULT1
//! - \b ADC_SAFETY_CHECK_RESULT2
//! - \b ADC_SAFETY_CHECK_OOT
//!
//! The \e checkEvent is a value \b ADC_SAFETY_CHECK_EVENTx where x is
//! a number from 1 to 4 specifying the safety check events available in
//! the safety checker specified by \e scIntEvtBase.
//!
//! The \e checkerNumber number is a value \b ADC_CHECKER_NUMBERx where x is
//! a number from 1 to 8 specifying which Checker Tile is to be selected in
//! the ADC module.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ADC_disableSafetyCheckEvt(uint32_t scIntEvtBase, ADC_Checker checkerNumber,
            ADC_SafetyCheckEvent checkEvent, ADC_SafetyCheckResult checkResult)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafeCheckINTEVTBaseValid(scIntEvtBase));

    //
    // Disables the safety checker event source.
    //
    HWREG(scIntEvtBase + ADC_O_CHECKEVT1SEL1 + ((uint32_t)checkEvent +
                   (uint32_t)checkResult) * 2UL) &= ~(1UL << (uint32_t)checkerNumber);
}

//*****************************************************************************
//
//! Enables the safety checker interrupt sources for selected instance.
//!
//! \param scIntEvtBase is the base address of ADC Safe Check INTEVT module.
//! \param checkResult is the desired ADC Safety Checker interrupt result.
//! \param checkerNumber is the number of the checker tile.
//!
//! This function enables the indicated safety checker interrupt sources.
//!
//! The \e checkResult specifies the result of the OOT or OVF events. It should
//! be one of the following values.
//!
//! - \b ADC_SAFETY_CHECK_RESULT1
//! - \b ADC_SAFETY_CHECK_RESULT2
//! - \b ADC_SAFETY_CHECK_OOT
//!
//! The \e checkerNumber number is a value \b ADC_CHECKER_NUMBERx where x is
//! a number from 1 to 8 specifying which Checker Tile is to be selected in
//! the ADC module.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ADC_enableSafetyCheckInt(uint32_t scIntEvtBase, ADC_Checker checkerNumber,
                         ADC_SafetyCheckResult checkResult)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafeCheckINTEVTBaseValid(scIntEvtBase));

    //
    // Enables the safety checker interrupt source.
    //
    HWREG(scIntEvtBase + ADC_O_CHECKINTSEL1 + (uint32_t)checkResult * 2UL) |=
                                              (1UL << (uint32_t)checkerNumber);
}

//*****************************************************************************
//
//! Disables the safety checker interrupt sources for selected instance.
//!
//! \param scIntEvtBase is the base address of ADC Safe Check INTEVT module.
//! \param checkResult is the desired ADC Safety Checker interrupt result.
//! \param checkerNumber is the number of the checker tile.
//!
//! This function disables the indicated safety checker interrupt sources.
//!
//! The \e checkResult specifies the result of the OOT or OVF events. It should
//! be one of the following values.
//!
//! - \b ADC_SAFETY_CHECK_RESULT1
//! - \b ADC_SAFETY_CHECK_RESULT2
//! - \b ADC_SAFETY_CHECK_OOT
//!
//! The \e checkerNumber number is a value \b ADC_CHECKER_NUMBERx where x is
//! a number from 1 to 8 specifying which Checker Tile is to be selected in
//! the ADC module.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ADC_disableSafetyCheckInt(uint32_t scIntEvtBase, ADC_Checker checkerNumber,
                          ADC_SafetyCheckResult checkResult)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafeCheckINTEVTBaseValid(scIntEvtBase));

    //
    // Enables the safety checker interrupt source.
    //
    HWREG(scIntEvtBase + ADC_O_CHECKINTSEL1 + (uint32_t)checkResult * 2UL) &=
                                             ~(1UL << (uint32_t)checkerNumber);
}

//*****************************************************************************
//
//! Get the ADC safety checker OOT and OVF event status.
//!
//! \param scIntEvtBase is the base address of ADC Safe Check INTEVT module.
//! \param checkerFlag is the desired ADC Safety Checker event status.
//! \param checkerNumber is the number of the checker tile.
//!
//! This function returns the event status for the OOT or OVF event.
//!
//! The \e checkerFlag specifies the ADC safety checker event status of
//! OOT or OVF events. It should be one of the following values.
//!
//! - \b ADC_SAFETY_CHECK_OOT_FLG
//! - \b ADC_SAFETY_CHECK_RES1OVF_FLG
//! - \b ADC_SAFETY_CHECK_RES2OVF_FLG
//!
//! The \e checkerNumber number is a value \b ADC_SAFETY_CHECKERx where x is
//! a number from 1 to 8 specifying which Checker Tile is to be selected in
//! the ADC module specified by \e scIntEvtBase.
//!
//! \return Returns the status of the safety checker event module for
//! the selected instance.
//
//*****************************************************************************
static inline bool
ADC_getSafetyCheckStatus(uint32_t scIntEvtBase, ADC_Checker checkerNumber,
                            ADC_SafetyCheckFlag checkerFlag)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafeCheckINTEVTBaseValid(scIntEvtBase));

    //
    // Get the specified safety checker event status.
    //
    return(HWREG(scIntEvtBase + ADC_O_OOTFLG + (uint32_t)checkerFlag * 2UL) &
                                              (1U << (uint32_t)checkerNumber));
}

//*****************************************************************************
//
//! Clears the ADC safety checker OOT and OVF event status.
//!
//! \param scIntEvtBase is the base address of ADC Safe Check INTEVT module.
//! \param checkerFlag is the desired ADC Safety Checker event status.
//! \param checkerNumber is the number of the checker tile.
//!
//! This funtion clears the specified ADC Safety Checker event status so that
//! they no longer assert.
//!
//! \e checkerFlag takes one of the values \b ADC_SAFETY_CHECK_OOT_FLG,
//! \b ADC_SAFETY_CHECK_RES1OVF_FLG or \b ADC_SAFETY_CHECK_RES2OVF_FLG
//! to express which of the three event status of the ADC Safety Checker should
//! be cleared.
//!
//! The \e checkerNumber number is a value \b ADC_SAFETY_CHECKERx where x is
//! a number from 1 to 8 specifying which Checker Tile is to be selected in
//! the ADC module specified by \e scIntEvtBase.
//!
//! \return None.
//
//*****************************************************************************
static inline void
ADC_clearSafetyCheckStatus(uint32_t scIntEvtBase, ADC_Checker checkerNumber,
                            ADC_SafetyCheckFlag checkerFlag)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafeCheckINTEVTBaseValid(scIntEvtBase));

    //
    // Clear the specified safety checker event status.
    //
    HWREG(scIntEvtBase + ADC_O_OOTFLGCLR + (uint32_t)checkerFlag * 2UL) =
                                                1UL << (uint32_t)checkerNumber;
}

//*****************************************************************************
//
//! Get the ADC safety checker interrupt status.
//!
//! \param scIntEvtBase is the base address of ADC Safe Check INTEVT module.
//!
//! This function returns the interrupt status for the OOT or OVF event.
//!
//! \return Returns the status of the safety checker interrupt for
//! the selected instance.
//
//*****************************************************************************
static inline uint32_t
ADC_getSafetyCheckIntStatus(uint32_t scIntEvtBase)
{
    //
    // Check the arguments.
    //
    ASSERT(ADC_isSafeCheckINTEVTBaseValid(scIntEvtBase));
    //
    // Get the specified safety checker interrupt status.
    //
    return(HWREG(scIntEvtBase + ADC_O_CHECKINTFLG));

